src/InformationRegisters/КИИ_МониторингОшибокЖурнал/КИИ_МониторингОшибокЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокЖурнал</name>
  <resources>
    <name>ПерваяДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнееВхождение</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОтправок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Критичность</name>
    <type>
      <types>EnumRef.КИИ_УровниКритичности</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетАнализа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроанализированаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаАнализаИИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправленаВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Игнорировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОтИИ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КИИ_МониторингОшибокСтатистика/КИИ_МониторингОшибокСтатистика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_МониторингОшибокСтатистика</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ХешОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/КИИ_ЛогЗапросовИИ/КИИ_ЛогЗапросовИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КИИ_ЛогЗапросовИИ</name>
  <resources>
    <name>ВходныеТокены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходныеТокены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоТокенов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыходныеТокеныВКеше</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОтветаСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзКеша</name>
    <comment>Истина — ответ вернулся из локального кеша, не от провайдера.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>IDЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.КИИ_МоделиИИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗавершения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательскийПромпт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемныйПромпт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияСообщенийJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреляцияАгента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УниверсальнаяДатаВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/КИИ_УровниКритичности/КИИ_УровниКритичности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_УровниКритичности</name>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Критическая</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КИИ_ПравилаИгнорированияОшибок/КИИ_ПравилаИгнорированияОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_ПравилаИгнорированияОшибок</name>
  <comment>Правила подавления ошибок мониторинга: совпавшая ошибка помечается Игнорировать на этапе сбора (не идёт ни в анализ, ни в телеграм).</comment>
  <attributes>
    <name>Событие</name>
    <comment>Совпадение по имени события (подстрока, пустое = любое)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <comment>Совпадение по метаданным (подстрока)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСодержит</name>
    <comment>Совпадение по подстроке текста ошибки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <comment>Правило включено</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/КИИ_МониторингОшибокРегистры/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль: КИИ_МониторингОшибокРегистры
// Назначение: Запись/обновление/очистка регистров мониторинга ошибок
//             (Журнал, Статистика, ЛогЗапросовИИ).
// Выделен из КИИ_МониторингОшибок (декомпозиция god-модуля, 2026-07-08).
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записывает уникальные (дедуплицированные) ошибки в регистр Журнал и статистику.
//
// Параметры:
//  УникальныеОшибки - Соответствие из КлючИЗначение - хеш → {ЗаписьЖР, Количество}
//
Процедура ЗаписатьУникальныеОшибкиВРегистр(УникальныеОшибки) Экспорт

	// Пачка Журнал+Статистика ДОЛЖНА быть атомарной: без транзакции частичный сбой оставлял
	// закоммиченные записи → на повторном сборе (дата не сохранена) счетчик задваивался.
	НачатьТранзакцию();
	Попытка

	Для Каждого Элемент Из УникальныеОшибки Цикл

		Хеш       = Элемент.Ключ;
		Данные     = Элемент.Значение;
		ЗаписьЖурнала        = Данные.ЗаписьЖР;
		Количество = Данные.Количество;

		НаборЗаписей = РегистрыСведений.КИИ_МониторингОшибокЖурнал.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ХешОшибки.Установить(Хеш);
		НаборЗаписей.Прочитать();

		Если НаборЗаписей.Количество() = 0 Тогда

			Зап = НаборЗаписей.Добавить();
			Зап.ХешОшибки            = Хеш;
			Зап.ПерваяДатаВремя      = ЗаписьЖурнала.Дата;
			Зап.ПоследнееВхождение   = ЗаписьЖурнала.Дата;
			Зап.КоличествоПовторений = Количество;
			Зап.ТекстОшибки          = ЗаписьЖурнала.Комментарий;
			Зап.Событие              = Строка(ЗаписьЖурнала.Событие);
			Зап.Пользователь         = Строка(ЗаписьЖурнала.ИмяПользователя);
			Зап.Компьютер            = Строка(ЗаписьЖурнала.Компьютер);
			Зап.Метаданные           = ПолучитьПредставлениеМетаданных(ЗаписьЖурнала);
			Зап.Критичность          = Перечисления.КИИ_УровниКритичности.Средняя;
			Зап.ТребуетАнализа       = Истина;
			Зап.ПроанализированаИИ   = Ложь;
			Зап.ОтправленаВТелеграм  = Ложь;
			Зап.Игнорировать         = ЭтоПодавляемаяОшибка(Зап.Событие, Зап.Метаданные, Зап.ТекстОшибки);
			Зап.ОшибкаАнализаИИ     = Ложь;
			Зап.КоличествоОтправок   = 0;

		Иначе

			Зап = НаборЗаписей[0];
			Зап.ПоследнееВхождение   = ЗаписьЖурнала.Дата;
			Зап.КоличествоПовторений = Зап.КоличествоПовторений + Количество;

		КонецЕсли;

		НаборЗаписей.Записать();

		ЗаписатьДвижениеСтатистики(Хеш, ЗаписьЖурнала, Количество);

	КонецЦикла;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Проверяет, подавляется ли ошибка правилом из справочника КИИ_ПравилаИгнорированияОшибок.
// Совпадение = ВСЕ непустые критерии правила (Событие/Метаданные/ТекстСодержит) содержатся
// в соответствующих полях ошибки (подстрока). Правило без единого критерия НЕ матчит (защита
// от «пустышки, глушащей всё»). Совпало → ошибку помечаем Игнорировать на этапе сбора.
Функция ЭтоПодавляемаяОшибка(Знач Событие, Знач Метаданные, Знач ТекстОшибки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Правила.Событие       КАК Событие,
		|	Правила.Метаданные    КАК Метаданные,
		|	Правила.ТекстСодержит КАК ТекстСодержит
		|ИЗ
		|	Справочник.КИИ_ПравилаИгнорированияОшибок КАК Правила
		|ГДЕ
		|	Правила.Активно = ИСТИНА
		|	И Правила.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		ЕстьКритерий = Ложь;
		Совпало      = Истина;

		ПрименитьКритерийПравила(Событие, Выборка.Событие, ЕстьКритерий, Совпало);
		ПрименитьКритерийПравила(Метаданные, Выборка.Метаданные, ЕстьКритерий, Совпало);
		ПрименитьКритерийПравила(ТекстОшибки, Выборка.ТекстСодержит, ЕстьКритерий, Совпало);

		Если Совпало И ЕстьКритерий Тогда
			Возврат Истина;
		КонецЕсли;

	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Обновляет поля записи регистра Журнал по хешу ошибки.
//
// Параметры:
//  ХешОшибки    - Строка - ключ записи
//  ЗначенияПолей - Структура - имя поля → значение
//
Процедура ОбновитьЗаписьРегистраОшибки(ХешОшибки, ЗначенияПолей) Экспорт

	НаборЗаписей = РегистрыСведений.КИИ_МониторингОшибокЖурнал.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ХешОшибки.Установить(ХешОшибки);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
		Зап = НаборЗаписей[0];
		Для Каждого Элемент Из ЗначенияПолей Цикл
			Зап[Элемент.Ключ] = Элемент.Значение;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

// Помечает ошибку как отправленную в Telegram (флаг + дата + счетчик).
// Параметры:
//  ХешОшибки - Строка - хеш ошибки (ключ записи регистра Журнал).
Процедура ОбновитьФлагОтправкиТелеграм(ХешОшибки) Экспорт

	ПоляОбновления = Новый Структура(
		"ОтправленаВТелеграм, ДатаПоследнейОтправки, КоличествоОтправок",
		Истина, ТекущаяДатаСеанса(), 1);
	ОбновитьЗаписьРегистраОшибки(ХешОшибки, ПоляОбновления);

КонецПроцедуры

// Удаляет из регистра Журнал записи старше пороговой даты. Возвращает число удаленных.
// Параметры:
//  ПороговаяДата - Дата - удаляются записи старше этой даты.
// Возвращаемое значение:
//  Число - количество удаленных записей.
Функция ОчиститьРегистрЖурнала(ПороговаяДата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Р.ХешОшибки КАК ХешОшибки
	|ИЗ
	|	РегистрСведений.КИИ_МониторингОшибокЖурнал КАК Р
	|ГДЕ
	|	Р.ПоследнееВхождение < &ПороговаяДата";
	Запрос.УстановитьПараметр("ПороговаяДата", ПороговаяДата);

	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 0;

	Пока Выборка.Следующий() Цикл
		Попытка
			НаборЗаписей = РегистрыСведений.КИИ_МониторингОшибокЖурнал.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ХешОшибки.Установить(Выборка.ХешОшибки);
			НаборЗаписей.Прочитать();
			Счетчик = Счетчик + НаборЗаписей.Количество();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.МониторингОшибок.Очистка'"),
				УровеньЖурналаРегистрации.Ошибка, , Выборка.ХешОшибки, ТекстОшибки);
		КонецПопытки;
	КонецЦикла;

	Возврат Счетчик;

КонецФункции

// Удаляет из регистра Статистика записи старше пороговой даты. Возвращает число удаленных.
// Параметры:
//  ПороговаяДата - Дата - удаляются записи старше этой даты.
// Возвращаемое значение:
//  Число - количество удаленных записей.
Функция ОчиститьРегистрСтатистики(ПороговаяДата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Р.Период КАК Период
	|ИЗ
	|	РегистрСведений.КИИ_МониторингОшибокСтатистика КАК Р
	|ГДЕ
	|	Р.Период < &ПороговаяДата";
	Запрос.УстановитьПараметр("ПороговаяДата", ПороговаяДата);

	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 0;

	Пока Выборка.Следующий() Цикл
		Попытка
			НаборЗаписей = РегистрыСведений.КИИ_МониторингОшибокСтатистика.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Значение      = Выборка.Период;
			НаборЗаписей.Отбор.Период.Использование = Истина;
			НаборЗаписей.Прочитать();
			Счетчик = Счетчик + НаборЗаписей.Количество();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.МониторингОшибок.Очистка'"),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;
	КонецЦикла;

	Возврат Счетчик;

КонецФункции

// Удаляет из регистра ЛогЗапросовИИ записи старше пороговой даты. Возвращает число удаленных.
// Параметры:
//  ПороговаяДата - Дата - удаляются записи старше этой даты.
// Возвращаемое значение:
//  Число - количество удаленных записей.
Функция ОчиститьРегистрЛогаИИ(ПороговаяДата) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Р.Идентификатор                   КАК Идентификатор,
	|	Р.УниверсальнаяДатаВМиллисекундах КАК УниверсальнаяДатаВМиллисекундах
	|ИЗ
	|	РегистрСведений.КИИ_ЛогЗапросовИИ КАК Р
	|ГДЕ
	|	Р.ДатаЗапроса < &ПороговаяДата";
	Запрос.УстановитьПараметр("ПороговаяДата", ПороговаяДата);

	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 0;

	Пока Выборка.Следующий() Цикл
		Попытка
			МенеджерЗаписи = РегистрыСведений.КИИ_ЛогЗапросовИИ.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Идентификатор                   = Выборка.Идентификатор;
			МенеджерЗаписи.УниверсальнаяДатаВМиллисекундах = Выборка.УниверсальнаяДатаВМиллисекундах;
			МенеджерЗаписи.Удалить();
			Счетчик = Счетчик + 1;
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.МониторингОшибок.Очистка'"),
				УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;
	КонецЦикла;

	Возврат Счетчик;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Учитывает один критерий правила игнорирования: непустой критерий взводит ЕстьКритерий,
// отсутствие подстроки в значении поля сбрасывает Совпало. Уже несовпавшее правило
// (Совпало = Ложь) дальше не проверяется. Флаги мутируются по ссылке.
Процедура ПрименитьКритерийПравила(Знач ЗначениеПоля, Знач Критерий, ЕстьКритерий, Совпало)

	Если Не Совпало Или Не ЗначениеЗаполнено(Критерий) Тогда
		Возврат;
	КонецЕсли;

	ЕстьКритерий = Истина;
	Если СтрНайти(ЗначениеПоля, Критерий) = 0 Тогда
		Совпало = Ложь;
	КонецЕсли;

КонецПроцедуры

// Регистрирует движение статистики за день ВОЗНИКНОВЕНИЯ ошибки, ключ (Период, ХешОшибки).
// Критичность/тип здесь НЕ хранятся (протухали бы после анализа) - берутся из Журнала джойном
// по ХешОшибки: единый источник, всегда актуально (аудит P2 #2, star-schema).
//
// Параметры:
//  ХешОшибки - Строка - хеш уникальной ошибки (ключ join к Журналу).
//  ЗаписьЖурнала - Структура - запись-источник; используется ЗаписьЖурнала.Дата для периода.
//  Количество - Число - на сколько увеличить счетчик за день возникновения.
Процедура ЗаписатьДвижениеСтатистики(Знач ХешОшибки, ЗаписьЖурнала, Количество)

	ПериодСтатистики = НачалоДня(ЗаписьЖурнала.Дата);

	НаборЗаписей = РегистрыСведений.КИИ_МониторингОшибокСтатистика.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Значение        = ПериодСтатистики;
	НаборЗаписей.Отбор.Период.Использование    = Истина;
	НаборЗаписей.Отбор.ХешОшибки.Значение       = ХешОшибки;
	НаборЗаписей.Отбор.ХешОшибки.Использование  = Истина;
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() = 0 Тогда
		Зап            = НаборЗаписей.Добавить();
		Зап.Период     = ПериодСтатистики;
		Зап.ХешОшибки  = ХешОшибки;
		Зап.Количество = Количество;
	Иначе
		НаборЗаписей[0].Количество = НаборЗаписей[0].Количество + Количество;
	КонецЕсли;

	НаборЗаписей.Записать();

КонецПроцедуры

// Строковое представление метаданных из записи ЖР (для поля Метаданные регистра Журнал).
Функция ПолучитьПредставлениеМетаданных(ЗаписьЖурнала)

	Попытка
		Если ЗначениеЗаполнено(ЗаписьЖурнала.МетаданныеПредставление) Тогда
			Возврат Строка(ЗаписьЖурнала.МетаданныеПредставление);
		ИначеЕсли ЗначениеЗаполнено(ЗаписьЖурнала.Данные) Тогда
			Возврат Строка(ЗаписьЖурнала.Данные);
		Иначе
			Возврат "";
		КонецЕсли;
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

#КонецОбласти
